[
  {
    "Domain": "Eukaryota",
    "Kingdom": "Animalia",
    "Phylum": "Arthropoda",
    "Class": "Malacostraca",
    "Order": "Decapoda",
    "Suborder": "Pleocyemata",
    "Family": "Nephropidae",
    "Genus": "Hoploparia",
    "Species": "gabbi",
    "Common Name": "Lobster",
    "Chronostratigraphy": "Campanian",
    "Image Filename": "Hoploparia.jpg",
    "Date Collected": "2025-02-22",
    "Collection": "Martin Family Generational Repository Of Paleontology",
    "Catalog Number": "MFGROP:3343",
    "Locality": "Hop Brook",
    "Location": "Monmouth County, New Jersey, USA",
    "Coordinates": "",
    "Geological Context": "Basal Navesink",
    "Collector": "Trevor",
    "Collection Method": "Surface Collecting",
    "Specimen Condition": "Pristine",
    "Notes": "",
    "Species Author": "Pilsby, 1901",
    "Species Source": "pilsbry1901crustacea",
    "Species Source Title": "Crustacea Of The Cretaceous Formation Of New Jersey",
    "Species Original Description": "Right propodite robust, evenly convex on both sides, but slightly more convex above than below, the surface slightly roughened everywhere by small flattened, separated, scale-like asperities; lower margin bluntly angular and marked by a slight groove; upper margin narrowly rounded,bearing a couple of short conic spines, inserted slightly below the edge and directed downward and forward; and on each side there is a rounded tubercle at the base of the dactylopodite. Fixed finger rather slender, with a series of coarse tubercles (worn flat) along its grasping edge. Dactylopodite armed with a short conic spine near its base (continuing the row of similar spines on the upper margin of the propodite), its grasping face with a series of coarse tubercles, worn flat. Carpopodite (?) irregularly cylindrical, gibbous, a little compressed and faintly grooved along the outer side, bearing a series of several short spines along the inner. Abdominal somites (P1. I, figs. 13, 14) with highly arched ter- gum, the surface punctate.",
    "Species Original Description Page Range": "115-116",
    "Size": "",
    "Weight": ""
  }
]
